
# Задайте список из вещественных чисел.
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.

# Пример:

# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

l = [1.1, 1.2, 3.1, 5, 10.01]

l2 = []

for i in l:
    l2.append(round(i-int(i), 3))

diff = max(l2)-min(l2)

print(f"List: {l2} --> max={max(l2)} & min={min(l2)} --> max-min={diff}")
