
# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

l = [2, 3, 4, 5, 6]
l2 = []
i = 0

while (i <= len(l)-1-i):
    l2.append(l[i] * l[len(l)-1-i])
    i += 1

print(l2)
